In [1]:
import numpy as np
import pandas as pd
marks_list= [55,25,75,40,90]
marks_arr= np.array(marks_list)
series_list = pd.Series(marks_list)
series_arr = pd.Series(marks_arr)
print(series_list)
print(series_arr)

0    55
1    25
2    75
3    40
4    90
dtype: int64
0    55
1    25
2    75
3    40
4    90
dtype: int64

In [2]:
student=['Mary','Peter','Susan','Toby','Vishal']
grades=['B-','A+','A-','B+','C']
df2= pd.DataFrame({'Student': student, 'Grade': grades})
df2

  Student Grade
0    Mary    B-
1   Peter    A+
2   Susan    A-
3    Toby    B+
4  Vishal     C

In [4]:
df2['num']=[10,11,12,13,14]
df2['roll']=[123,124,125,126,127]
df2

  Student Grade  num  roll
0    Mary    B-   10   123
1   Peter    A+   11   124
2   Susan    A-   12   125
3    Toby    B+   13   126
4  Vishal     C   14   127

In [5]:
df2[:3]

  Student Grade  num  roll
0    Mary    B-   10   123
1   Peter    A+   11   124
2   Susan    A-   12   125

In [6]:
df2[1:5:2]

  Student Grade  num  roll
1   Peter    A+   11   124
3    Toby    B+   13   126

In [7]:
df2[::-1]

  Student Grade  num  roll
4  Vishal     C   14   127
3    Toby    B+   13   126
2   Susan    A-   12   125
1   Peter    A+   11   124
0    Mary    B-   10   123

In [8]:
df2.iloc[1:4,1:4]

  Grade  num  roll
1    A+   11   124
2    A-   12   125
3    B+   13   126

In [11]:
df2.loc[[1,4],['Student','num']]

  Student  num
1   Peter   11
4  Vishal   14

In [12]:
df2.iloc[1:5,0:3]

  Student Grade  num
1   Peter    A+   11
2   Susan    A-   12
3    Toby    B+   13
4  Vishal     C   14

In [15]:
new_df2=df2.copy()
new_df2.drop(['num'], axis=1, inplace=True)
new_df2

  Student Grade  roll
0    Mary    B-   123
1   Peter    A+   124
2   Susan    A-   125
3    Toby    B+   126
4  Vishal     C   127

In [16]:
df2

  Student Grade  num  roll
0    Mary    B-   10   123
1   Peter    A+   11   124
2   Susan    A-   12   125
3    Toby    B+   13   126
4  Vishal     C   14   127

In [17]:
df2.drop([1],axis=0,inplace=True)
df2

  Student Grade  num  roll
0    Mary    B-   10   123
2   Susan    A-   12   125
3    Toby    B+   13   126
4  Vishal     C   14   127

In [19]:
data_cust= pd.DataFrame({ "customerID":['101','102','103','104'],
                         'category':['Medium','Medium','High','Low'],
                         'first_visit':['yes','no','yes','yes'],
                         'sales': [123,52,214,663]}, index=[0,1,2,3])
data_cust_new= pd.DataFrame({"sustomerID":['101','103','104','105'],
                             'distance': [12,9,44,21],
                             'sales': [123,214,663,331]}, index=[4,5,6,7])

In [20]:
concat_result = pd.concat([data_cust, data_cust_new])
print(concat_result)

  customerID category first_visit  sales sustomerID  distance
0        101   Medium         yes    123        NaN       NaN
1        102   Medium          no     52        NaN       NaN
2        103     High         yes    214        NaN       NaN
3        104      Low         yes    663        NaN       NaN
4        NaN      NaN         NaN    123        101      12.0
5        NaN      NaN         NaN    214        103       9.0
6        NaN      NaN         NaN    663        104      44.0
7        NaN      NaN         NaN    331        105      21.0

In [21]:
join_result = data_cust.join(data_cust_new, lsuffix='_cust', rsuffix='_new')
print(join_result)

  customerID category first_visit  sales_cust sustomerID  distance  sales_new
0        101   Medium         yes         123        NaN       NaN        NaN
1        102   Medium          no          52        NaN       NaN        NaN
2        103     High         yes         214        NaN       NaN        NaN
3        104      Low         yes         663        NaN       NaN        NaN

In [22]:
merge_result = pd.merge(data_cust, data_cust_new, 
                        left_on='customerID', right_on='sustomerID', 
                        how='inner')
print(merge_result)

  customerID category first_visit  sales_x sustomerID  distance  sales_y
0        101   Medium         yes      123        101        12      123
1        103     High         yes      214        103         9      214
2        104      Low         yes      663        104        44      663